Changed ascii art to mermaid
